/*
Разработать консольное приложение для управления информацией
о студентах и курсах, которое будет включать регистрацию
преподавателей, возможность добавления, удаления и отображения
студентов и курсов, а также сериализацию информации в файл и
ее считывание. Приложение должно включать функционал для
выдачи оценок студентам и записи их в отдельный файл.
- Использовать классы для организации кода (например, классы `Student`,
 `Course`, `User`, `StudentManager`, `CourseManager`).
- Применять коллекции (например, `ArrayList`, `HashMap`) для
хранения информации о студентах и курсах.
- Реализовать сериализацию и десериализацию объектов.
- Сохранять и загружать данные о пользователях, студентах и курсах в файл.
- Реализовать возможность выдачи оценок студентам, отображение списка оценок и курсов.
*/